GetLoadRotate
Syntax
SapObject.SapModel.AreaObj.GetLoadRotate
VB6 Procedure
Function GetLoadRotate(ByVal Name As String, ByRef NumberItems As Long, ByRef AreaName() As String, ByRef LoadPat() As String, ByRef Value() As Double, Optional ByVal ItemType As eItemType = Object) As Long
Parameters
Name
The name of an existing area object or group, depending on the value of the ItemType item.
NumberItems
The total number of rotate loads retrieved for the specified area objects.
AreaName
This is an array that includes the name of the area object associated with each rotate load.
LoadPat
This is an array that includes the name of the load pattern associated with each rotate load.
Value
This is an array that includes the angular velocity value. [Cyc/T]
ItemType
This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
If this item is Object, the assignments are retrieved for the area object specified by the Name item.
If this item is Group, the assignments are retrieved for all area objects in the group specified by the Name item.
If this item is SelectedObjects, assignments are retrieved for all selected area objects, and the Name item is ignored.
Remarks
This function retrieves the rotate load assignments to area objects.
The function returns zero if the load assignments are successfully retrieved; otherwise it returns a nonzero value.
VBA Example
Sub GetAreaObjectRotateLoad()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim NumberItems As Long
 Dim AreaName() As String
 Dim LoadPat() As String
 Dim Value() As Double
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.NewWall(2, 48, 2, 48)
 'assign area object rotate load
 ret = SapModel.AreaObj.SetLoadRotate("ALL", "DEAD", 30, , Group)
 'get area object rotate load
 ret = SapModel.AreaObj.GetLoadRotate("ALL", NumberItems, AreaName, LoadPat, Value, Group)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.00.
Changed nomenclature from Load Cases, Analysis Cases and Response Combinations to Load Patterns, Load Cases and Load Combinations, respectively, in version 12.00.
See Also
SetLoadRotate
DeleteLoadRotate